{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v4.10.0",
  "convertedBy": "TensorFlow.js Converter v4.10.0",
  "modelTopology": {
    "keras_version": "2.13.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "mobilenetv3_demo",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 224, 224, 3],
              "dtype": "float32",
              "sparse": false,
              "name": "input_1"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "predictions",
              "trainable": true,
              "dtype": "float32",
              "units": 4,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {"seed": null}
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              }
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "categorical_crossentropy",
      "metrics": ["accuracy"],
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "learning_rate": 0.001,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-07,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": [
        {
          "name": "predictions/kernel",
          "shape": [2048, 4],
          "dtype": "float32"
        },
        {
          "name": "predictions/bias",
          "shape": [4],
          "dtype": "float32"
        }
      ]
    }
  ]
}